{
"indoors":
[
{"id":"1","type":"Indoor","name":"Step Aerobics","benefit":"<p>Step aerobics has all the benefits of a high-intensity cardio workout without putting stress on your joints. It improves overall fitness by building strengthTrusted Source, reducing fat, and boosting your cardiovascular health. It also burns calories, making it an ideal way to maintain your target body weight.</p><p>The moves target your legs, upper body, and core, building strength and flexibility. They also improve your balance, coordination, and agility. The social component of a group class can be beneficial in forging new connections and may help to raise motivation levels. </p><p>Step aerobics is helpful in managing blood pressure and diabetes. People with osteoporosis or osteopenia can do this low-impact exercise to improve bone strength. People with arthritis can use a chair or stable object for extra balance during a step class. </p>","anatomy":"<p>Many of the reported step aerobic injuries are caused by technique errors or using a bench height that is too high for the participant's leg size. One of the more common technique errors is poor foot placement on the bench. By not having the foot fully placed on the bench, the heel can extend over the edge of the bench. This allows the heel to drop below the top of the step bench and done repetitively the Achilles tendon may get over stretched causing an Achilles tendinitis. </p><p>Another technique error is bouncing or hopping up and down off the bench. This puts a greater force load on the feet and legs especially if the participant is jumping off the bench with hand weights instead of stepping down. Stress fractures, shin splints and forefoot injuries, such as, metatarsalgia ( toe joint inflammation) and sesmoiditis ( inflammation of the two small bones below the first metatarsal- ball of the foot) can result. </p>","imgs":"imgs/step-aerobics.jpg"},
{"id":"2","type":"Indoor","name":"Dancing","benefit":"<p>Dance is a performing art form consisting of sequences of movement, either improvised or purposefully selected. This movement has aesthetic and often symbolic value. Dance can be categorized and described by its choreography, by its repertoire of movements, or by its historical period or place of origin. </p><p>An important distinction is to be drawn between the contexts of theatrical and participatory dance, although these two categories are not always completely separate, both may have special functions, whether social, ceremonial, competitive, erotic, martial, or sacred/liturgical. </p><p>Other forms of human movement are sometimes said to have a dance-like quality, including martial arts, gymnastics, cheerleading, figure skating, synchronized swimming, marching bands, and many other forms of athletics. </p>","anatomy":"<p>Dance anatomy is essentially the one of the musculoskeletal system, because this one is responsible for providing the human body with movement, hence the possibility of dancing. </p><p>It is widely recognized among our artistic community that having a good knowledge of dance anatomy is of great help for dancers, both for preventing injuries and for improving technical skills. </p><p>The muscular and skeletal systems are two of the 10 major organ systems in the human body. Organ systems are composed of two or more different organs which work together to provide a common function. In our case, the function is movement. </p>","imgs":"imgs/dancing.jpg"},
{"id":"3","type":"Indoor","name":"Kicking","benefit":"<p>Get your stretch on: In order to prevent injury, kickboxing routines incorporate more stretching than a typical workout. For example, the warm-up and stretching routines in my preferred kickbox routine, Kenpo X, has at least 15 minutes of yoga-type flexibility exercises. Stretching is very important once you start kicking and punching away. </p><p>Punching: Punching is routinely the first part of a kickboxing workout. Punches start out slow and speed up as the workout progresses. Punching can be done against a heavy bag like in boxing or just in the air. Combinations of punches, including jabs, hooks and crosses, help strengthen the upper body, build coordination and are a great way to get your heart rate up. </p><p>Kicking it: Once you are good and warm from punching, most routines transition into kicking. Kicks incorporate your entire lower body, which will get your heart pumping even faster. As your flexibility increases you can kick higher, harder and faster. It is best to start out kicking in the air and add resistance such as a heavy bag as you get more comfortable. </p>","anatomy":"<p>Involved in the kicking phase include the hip, which has a flexing action; the knee, which uses the quadriceps for extension; and the ankle, which again takes up plantar flexion. Hip flexor muscles work with the quadriceps and are responsible for the power behind the ball and, with this, the hamstring muscles must relax. </p><p>Using the quadriceps, you swing your femur forward from the hip in a movement known as hip flexion. This is the largest action of a joint when kicking a ball because the femur is the longest bone in the human body. Also, it’s because the kick starts from an extended position and finishes with a large follow-through. </p>","imgs":"imgs/kicking.jpg"},
{"id":"4","type":"Indoor","name":"Elliptical Trainer","benefit":"<p>An elliptical machine or trainer is great for weight loss. It burns somewhere between 150-400 calories in 30 minutes, depending on your current weight and elliptical speed. The exertion level is less when you use an elliptical machine for cardio. Hence, by the end of your 30-minute elliptical workout, you will still have the energy for a few more fat-burning exercises. </p><p>Elliptical workout is a low-impact exercise. It is gentle on your knees and is great for the elderly and people in the rehabilitation phase after a knee injury, osteoporosis, ankle injury, and knee arthritis. Walking or running on the treadmill is a high-impact exercise and may cause an injury or aggravate an old one. Hence, choose elliptical machines if you want to burn calories without getting injured. </p><p>The pedaling or stair-climbing action of the elliptical machines targets the leg muscles. It acts on the quadriceps, hamstrings, hip flexors, glutes, and calves. This is precisely why elliptical machine workouts are great for losing extra fat from your lower body, i.e., the lower belly area, hips, and thighs. </p>","anatomy":"<p>The elliptical trainer provides a low-impact but highly effective way to burn calories. Although this cross trainer primarily targets your leg muscles, many elliptical machines have moving handles to allow your arms to get in on the action. </p><p>The hamstrings, located on the back of the legs, perform knee flexion. Leg flexion and extension play a major role in elliptical aerobic exercise. Some elliptical cross-trainer exercise machines have a mechanism that allows you to increase the incline, which simulates hill climbing. This will cause increased flexion of the legs, providing even greater use of the hamstring muscles. Elliptical machines that allow you to move in reverse will put more emphasis on the hamstrings as they assist with hip extension, or backward movement of your thighs. </p>","imgs":"imgs/elliptical-trainer.jpg"},
{"id":"5","type":"Indoor","name":"Indoor rower","benefit":"<p>Indoor rowing is an excellent low-impact option for improving cardiovascular fitness and muscular endurance,” CITYROW Go lead instructor Hollis Tuttle previously told Men's Health. “Since it is a low impact sport, rowing reduces the risk of damage to weight-bearing joints, such as hips, ankles, and knees, which tend to be prone to injury and soreness when doing high-impact sports. </p><p>Like cycling, indoor rowing is also a great low impact sport. Exercising on a rowing machine minimises damage to weight-bearing joints, some of which are prone to injury and soreness in other activities. This means that the majority of individuals can enjoy a rowing workout no matter their age, size, sporting history or fitness levels. While rowing is less likely to result in overuse injuries compared with weight-bearing sports, it is advisable to invest time in learning the correct technique to minimise the risk of injury.</p><p>Indoor rowing provides excellent upper and lower body conditioning. A powerful leg drive starts every stroke – your quadriceps, hamstrings and gluteals fire up to push you along the slide. Then comes the power from the back and upper body – your abdominals and obliques activate to provide stability, assisting your torso to drive backwards. Simultaneously, your trapezius, latissimus dorsi and biceps work to pull the handle towards your body. </p> <p>Data published by Harvard Medical School suggests that a 30-minute rowing machine workout can burn up to an impressive 377 calories (data based on an 84kg individual). A brisk walk burns calories at a much slower rate – less than half – meaning you would need to exercise for over an hour to expend the same amount of energy! Indoor rowing promotes improvements to muscular strength and cardiovascular endurance. When your muscles are put under repeated physical stress, physiological adaptations occur to make them stronger – i.e. your muscle fibres will grow stronger and you will have an improved ability to utilise oxygen. A big advantage is that indoor rowing works both – simultaneously! </p><p> Committing to an exercise regime can be hard, so engaging in an activity where the exercise intensity is easily controllable will help to make it more enjoyable and keep motivation levels high. With adjustable intensity built into a rowing machine, the pace is entirely up to you and is determined by the resistance of the adjustable flywheel and/or how hard you push or pull during each rowing stroke. </p>","anatomy":"<p>Rowing is a coordinated muscle action that involves every large muscle group in the body. The following sections illustrate the primary muscles used during each movement of the rowing stroke.  </p><p>At the catch, your legs are compressed and your shins are vertical. Your triceps work to extend your arms, and the flexor muscles of your fingers and thumbs grip the handle. Your back muscles are relaxed, and your abdominals are flexing your torso forward. </p><p> You initiate the drive with the powerful muscles of your legs, and all of the shoulder muscles are contracting. As you work through the drive sequence, your biceps engage to pull the handle toward your abdomen, your back muscles work more as you swing your torso open, and your glutes and hamstrings contract to extend the hip. As the drive finishes with the arm pull-through, nearly all the muscles of your upper body engage. </p><p>At the finish, the abdominals stabilize the body, and the glutes and quads are contracting. The biceps and many of the back muscles are also contracting to help keep the torso in the finish position and to internally rotate the upper arms. </p>","imgs":"imgs/indoor-rower.jpg"},
{"id":"6","type":"Indoor","name":"Jazzercise","benefit":"<p>Jazzercise is a combination of aerobic exercise, HIIT cardio, and dance fitness safe and effective for all ages and fitness levels. Jazzercise Dance cardio is the perfect way to tone + tighten while brightening your mood. The classes increase your serotonin, dopamine, endorphins, and all the feel-good chemicals. Their high-energy Dance Mixx class is their standard 45-minute dance cardio class choreographed to the latest hits –  it will leave you dripping and dazzling!</p><p>Jazzercise isn’t just about dancing. The choreography is continuously updated to include the latest effective fitness methods + equipment like HIIT, Pilates, booty bands, and more. They offer a variety of in-studio classes and On Demand programming so you can vary your regimen based on your desired results. </p><p>As you mentioned, dancing is a proven mood-booster and Jazzercise choreography combines dance moves to the latest hits and proven effective fitness methods and equipment for a fun workout. You won’t leave without a smile on your face! </p><p>Dance cardio is a great way to get your heart pumping. It helps to boost blood circulation that kickstarts disease and infection-fighters throughout your body! </p>","anatomy":"<p>The hamstrings cross and act upon two joints being the hip and the knee. Semitendinosus and semimembranosus extend the hip when the trunk is fixed, they also flex the knee and medially (inwardly) rotate the lower leg when the knee is bent. The long head of the biceps femoris extends the hip, such as when you begin to walk, both short and long heads flex the knee and laterally (outwardly) rotate the lower leg when the knee is bent. The hamstrings play a crucial role in many daily activities such as walking, running, jumping, and controlling some movement in the trunk. In walking and running, they are most important as act as the brakes against the quadriceps in the deceleration of knee extension. </p><p>For example if your glutes are weak and not functioning correctly, which is extremely common, the hamstring has no choice but to increase the workload. You can confirm if this is the case when applying simple bridge tests. If the client experiences any hamstring cramping on a single leg hip extension hold, this is a case of hamstrings taking over due to weak glutes. No amount of hamstring stretching will ever change anything until you strengthen the glutes. And you actually would not want it to either, for then you would have no brakes for the hip and knee! </p>","imgs":"imgs/jazzercise.jpg"}
],

"outdoors":
[
{"id":"1","type":"Outdoor","name":"Hiking","benefit":"<p>Hiking is a long, vigorous walk, usually on trails or footpaths in the countryside. Walking for pleasure developed in Europe during the eighteenth century. Religious pilgrimages have existed much longer but they involve walking long distances for a spiritual purpose associated with specific religions. </p><p>Hiking is the preferred term in Canada and the United States, the term walking is used in these regions for shorter, particularly urban walks. In the United Kingdom and the Republic of Ireland, the word walking describes all forms of walking, whether it is a walk in the park or backpacking in the Alps. The word hiking is also often used in the UK, along with rambling (a slightly old-fashioned term), hillwalking, and fell walking (a term mostly used for hillwalking in northern England).  </p>","anatomy":"<p>Hiking uphill is my favorite challenge. Nothing is better than pushing off your foot strongly, feeling your hamstring and quad engage, and working your way up to the peak. To do this safely and anatomically correctly, focus on keeping your knees directly over your toes. Remember to use the backside of your body—your hamstrings, calves, and glutes are usually forgotten. This forces our quads and hip flexors to work overtime. Hip flexors are easy to irritate, so try to relax them and use your booty instead. </p><p>Hiking downhill is a knee killer. It just is. There is not much we can do about that but go slow, use hiking poles if you can, lean back, and if need be, do the classic butt scootch down! Keep your knees over your toes and really engage your core. When we hike down we often slightly lean back which puts a ton of pressure on our lower backs. Engage your abdominal muscles to avoid any lower back pain. </p>","imgs":"imgs/hiking.jpg"},
{"id":"2","type":"Outdoor","name":"Bicycling","benefit":"<p>Bicycles provide numerous possible benefits in comparison with motor vehicles, including the sustained physical exercise involved in cycling, easier parking, increased maneuverability, and access to roads, bike paths and rural trails. Cycling also offers a reduced consumption of fossil fuels, less air and noise pollution, reduced greenhouse gas emissions, and greatly reduced traffic congestion. </p><p>These have a lower financial cost for users as well as for society at large (negligible damage to roads, less road area required). By fitting bicycle racks on the front of buses, transit agencies can significantly increase the areas they can serve. </p><p>Among the disadvantages of cycling are the requirement of bicycles (excepting tricycles or quadricycles) to be balanced by the rider in order to remain upright, the reduced protection in crashes in comparison to motor vehicles, often longer travel time (except in densely populated areas), vulnerability to weather conditions, difficulty in transporting passengers, and the fact that a basic level of fitness is required for cycling moderate to long distances. </p>","anatomy":"<p>Using the same methods that elite cyclists use, you can employ this well-rounded collection of 89 strength and conditioning exercises to maximize cycling power, speed, and endurance to improve your cycling performance. Each exercise includes clear step-by-step descriptions and full-color anatomical illustrations that highlight the primary muscle being used. You’ll find dozens of variations that use a wide range of training equipment so you can modify exercises to target specific areas, and minimize common cycling injuries. </p><p>Whether you’re training for an upcoming century ride or just want to top that killer hill with strength to spare, Cycling Anatomy will help you reach top performance, avoid injury, and ensure you get the most out of every ride. </p>","imgs":"imgs/bicycling.jpg"},
{"id":"3","type":"Outdoor","name":"Moderate walking","benefit":"<p>Walking (also known as ambulation) is one of the main gaits of terrestrial locomotion among legged animals. Walking is typically slower than running and other gaits.  </p><p>A brisk walk can help you burn about 300 calories. It helps you lose body fat and use up stored sugars. The longer you walk, the more calories you will burn. In addition, morning walks also help curb the sweet tooth. It helps cut down sugar cravings and is beneficial to our health. With improved blood sugar levels, you can reduce the risk of Type 2 diabetes.  </p><p> Walking uses stored energy from the body and leaves your body tired. It happens mainly in cases of people who are not as active physically. Now, after any activity, your body needs rest. And that is how regular walking helps regulate the sleep cycle and gives you sound sleep.</p>","anatomy":"<p>Our body is a masterpiece creation and understanding it can be difficult at times. But with this bright and eye-catching infographic, explaining complex information in a visually engaging way is easier than ever. </p><p>Show how amazing the human body is with this engaging infographic, or check out thousands of other infographic templates to find one that suits your design needs. </p>","imgs":"imgs/walking.jpg"},
{"id":"4","type":"Outdoor","name":"Downhill skiing","benefit":"<p>Alpine skiing, or downhill skiing, is the pastime of sliding down snow-covered slopes on skis with fixed-heel bindings, unlike other types of skiing (cross-country, Telemark, or ski jumping), which use skis with free-heel bindings. Whether for recreation or for sport, it is typically practiced at ski resorts, which provide such services as ski lifts, artificial snow making, snow grooming, restaurants, and ski patrol. </p><p>Skiing and snowboarding are great cardiovascular exercises that can help families burn some serious calories and lose weight. The ultimate number burned per hour is based on weight and proficiency, but according to Harvard Medical School, someone who is 185 pounds burns 266 calories in 30 minutes of downhill skiing. Beginners can get an extra calorie burn by walking up the slope rather than using the ski lift. And, for the advanced skiers, the steeper the slope, the more calories burned because the body has to work harder to keep balanced. Believe it or not the cold weather also contributes to added calorie burn, since the body is forced to work harder to raise its own body temperature. </p><p>Take the gym workout to the slopes this winter. Skiing and snowboarding heavily targets the lower body muscles. Skiing naturally keeps the body in the squat position, which strengthens the quads, hamstrings, calves, and glutes. Snowboarding also works some muscles that may not be used as often like the ankles and feet, which are engaged to help steer the board and maintain balance. </p>","anatomy":"<p>First, the fine movements that we use to tip the skis on edge, whether carving or not: Inversion is what we do with the inside foot, while eversion is what we do with the outside. See Inversion and eversion and We ski with the feet and ankles. These are at the movements at the base of the kinetic chain and are then complemented by moving the knees and femurs (active or passive). We use these to put the skis on and off the edge and fine balance adjustments. </p><p>These are very useful for fore-aft and pressure adjustments. Dorsiflexion, closing the ankle will tend to put the hips more forward, while plantar flexion, opening the ankle will put the hips further back, depending on how flexed the leg is. These are a big part of why Keep your feet underneath you is important. When in closed chain mode, the skis are weighted, these movements are not very strong, as we try to leverage the skis and boots to bring the body forward or back. In open chain mode, when the skis are unweighted, these can have a large impact on fore/aft adjustment, together with with moving the boots fore/aft. </p>","imgs":"imgs/skiing.jpg"},
{"id":"5","type":"Outdoor","name":"Running","benefit":"<p>Running is a great exercise for the heart. Over time, it helps your heart pump more efficiently. Running keeps the arteries elastic so blood flows smoothly. Cardiovascular exercise also lowers your blood pressure and bad (LDL) cholesterol, but increases good (HDL) cholesterol, thus reducing your risk of heart disease. </p><p>Running is excellent to burn fat.As it involves large muscle groups, it is actually one of the best ways to burn calories. According to the Mayo Clinic, a 73-kg individual can burn some 600 calories per hour when running at 12 km/h. Want to lose weight, stay slim or have a firm butt? Start running.</p><p>Running is a weight-bearing exercise. The pounding on the ground puts stress on the skeletal system which in turn boosts bone mineral density (BMD). Higher BMD means stronger bones. This reduces the risk of osteoporosis, falls and fractures as you age. </p><p>Research has shown that running and other aerobic exercises trigger brain cell growth in the hippocampus – the part of the brain responsible for learning and memory. Running also develops the areas of the brain which control movement, coordination and long-term memory. </p>","anatomy":"<p>Running Anatomy features 48 of the most effective strength exercises for runners, each with clear step-by-step descriptions and full-color anatomical illustrations highlighting the muscles in action. Each illustration helps you better understand how muscles, ligaments, and tendons all work together as your body moves. Running Anatomy clearly links each exercise to running performance. You’ll see how to strengthen specific muscles and improve gait efficiency for faster times and more fluid runs. Plus you’ll learn how to eliminate anatomical imbalances that can lead to the most common injuries that runners face, including plantar fasciitis, lower-back pain, knee aches and strains, and torn muscles and tendons. </p><p>Feel prepared for any challenge that comes your way. You’ll find variations to train for every condition and competition—for various terrains, speeds, elevations, and distances, from sprint to marathon. You’ll also learn how new gear and technology-enhanced equipment can maximize your training and performance. Whether you’re a fitness runner looking to conquer hills with more speed and strength or a competitive runner looking for that extra edge in performance and a finishing kick, Running Anatomy will ensure that you’re ready to achieve your personal best. </p>","imgs":"imgs/running.jpg"},
{"id":"6","type":"Outdoor","name":"Skateboarding","benefit":"<p>Similar to other sports, health benefits are obviously correlated with participating in a physical activity. Skateboarding health benefits are slightly different than those of common youth sports like football, soccer, and basketball. Skateboarding offers an array of advantages including coordination, pain tolerance, stress relief, precision, reflexes and patience. </p><p>Coordination – Skateboarding improves hand, eye, leg and feet coordination. When skateboarding, you need to alter your movements so you skate smoothly and accurately. </p><p>Pain Tolerance – Other sports improve your pain tolerance, but learning how to skateboard includes constantly falling, tripping, cutting your knees and elbows, etc. Believe it or not, this helps to improve your tolerance and build up resilience. Stress Relief – Stresses consume people, even kids, all the time. Skateboarding is an avenue to relieve some of those stresses or frustrations. </p><p>Precision – Skateboarding takes a lot to pick up on. You are constantly adjusting weight from one direction to another, switching your speed, and, when good enough, perfecting tricks. </p> <p>Reflexes – This one ties together with coordination. When falling or stopping quickly, you need to have quick reflexes to brace yourself or prevent a collision from happening. You learn quickly that running into a railing is not ideal. </p><p>Patience – Skateboarding, like other sports, requires an immense amount of patience. You will not be the next Tony Hawk after your first time on the board. Falling countless times, missing that tricky bend, and hitting that awesome trick will test your patience time after time. </p>","anatomy":"<p>Skateboarding is an activity that requires balance, coordination, good timing, and a skateboard. Skaters have plenty of options when it comes to the type of skateboard they can ride, and every part of the skateboard serves a specific purpose. </p><p>A complete skateboard is more than just a deck on wheels—it consists of many different parts, each with their own design and function: Deck - Grip tape - Trucks - Wheels - Bearings - Hardware - Risers - Shock pads. </p>","imgs":"imgs/skateboarding.jpg"}
],

"both":
[
{"id":"1","type":"Both","name":"Tennis","benefit":"<p>Doubles is played by two teams of two players each, most often all-male or all-female. It utilizes a wider court than singles matches: it includes the area in the alley (tramlines, in British terminology), whereas singles does not. The two players on the receiving side change positions after each point played (one at the net and the other near the baseline, preparing to return serve). Most of the singles rules are applicable for doubles tennis, but there are few exceptions. First and foremost, the court side is wider. The boundaries are extended from side to side to the doubles sidelines. This includes the alleys between the singles and doubles sidelines on the court. The doubles tennis court boundaries are only in play after the ball is served. </p><p> Mixed doubles is played the same as doubles, but with one man and one woman per team. This form of tennis is rare in the professional game because the men’s and women’s tours are organized separately (by the ATP and WTA, respectively). However, all four Grand Slam tournaments hold a mixed doubles competition, alongside the men’s and women’s doubles, featuring many of the same players. There is also an annual mixed tournament for national teams, the Hopman Cup, which includes mixed doubles matches. Additionally, there have been mixed doubles events at the Summer Olympics on various occasions (In 1900, from 1912 until 1920 and again since 2012). </p><p>Tennis can be played as doubles or singles, but either way you have to play with another person. Being able to socialize with opponents and partners is a huge benefit of the game! You are also around others who share similar interests and goals, which is very physiologically rewarding. It’s a great way for young players to make friends and develop their social skills. </p> <p>Think of tennis as a zero calorie brain food! Playing tennis can improve critical thinking, mental alertness, and tactical thinking by making connections in the brain. Tennis also helps regulate serotonin—a brain chemical linked to functions such as sleep cycle, appetite, and your emotional state. Having trouble sleeping or keeping your emotions in check? Hit the court! </p>","anatomy":"<p>Emphasizing a movement-based approach to conditioning, Tennis Anatomy offers over 75 exercises designed to mimic the unique physical demands of the game and train the body as an integrated unit to maximize explosive power. </p><p>Each exercise offers step-by-step descriptions and full-color anatomical illustrations highlighting the muscles in action. Exercises for the lower body, core, shoulders, back, chest, arms, and wrists—along with information on proper acceleration and deceleration mechanics, rotational strengthening, and lateral movement skills—will help you cover the court with strength and efficiency. Illustrations of the active muscles for forehands, backhands, volleys, and serves show you how each exercise is fundamentally linked to tennis performance. </p>","imgs":"imgs/tennis.jpg"},
{"id":"2","type":"Both","name":"Softball","benefit":"<p>Softball is a game similar to baseball played with a larger ball (11 to 16 inches or 28 to 40 cm circumference) on a field that has base lengths of 60 feet, a pitcher’s mound that ranges from 35 to 43 (professional is 43) feet away from home plate, and a home run fence that is 220–300 feet away from home plate, depending on the type of softball being played. Softball is played competitively at club levels, the college level, and the professional level. </p><p>There are two rules codes for softball generally: slow-pitch softball and fast pitch softball. Slow-pitch softball is the most common type, while women’s fast pitch softball is a Summer Olympic sport and is played professionally by women. Sixteen-inch softball, a variant, is less common but remains a direct descendant of the original game created by George Hancock. Softball rules vary somewhat from those of baseball. The game moves at a faster pace than traditional baseball due to the field being smaller and the bases and the fielders being closer to home plate. In fast pitch softball the entire infield is dirt, and softball mounds are also flat, while baseball mounds are a small hill. Softballs are pitched in a windmill style, but baseballs are pitched overhand. This changes the arc of the ball when approaching the plate. </p><p>As a sport predominantly played by women, softball is one of the biggest youth sports for girls. But even beyond little league competition, many recreational leagues offer opportunities for co-ed softball teams to get out and play. It’s a popular summer past time, and it has many health and fitness benefits: Provides total body conditioning: Unlike other sports, softball is an activity that requires multiple skills, and therefore provides total body conditioning. Running, swinging, fielding and throwing all require a coordinated effort from numerous muscles throughout the body. </p><p>Anaerobic benefits and strength: Every single action in softball is an explosive action. Hitting, throwing, quick lateral movements, jumps off the bases and others are all explosive. In addition, softball players need throwing power and acceleration power. A base in overall body strength and maximal strength is also important, it serves as a foundation to build muscular power. Some muscular endurance is also beneficial, especially for pitchers. </p>","anatomy":"<p>Two legs, one arm. Two arms, one leg. A broken collarbone, a sprained knee, a ruptured Achilles, and a sore heel. Blind, deaf, mute, brain injury, cancer, paralyzed. Champions don’t all look or feel the same. They don’t all walk the same path or wear the same medals or hoist the same trophies. They don’t all get there in the same time. But the one thing they all have in common is victory as the outcome. Some kind of victory, some kind of big win. They’ve all achieved it. And it changed them for good. Champions are made in the heat and the snow, in the sweat of the weight rack, in the hours of repetitions. They don’t just happen. They are made up of moving parts, some easy to spot and easy to piece together, others hidden and not so visible day to day. Head to toe, they have a few non- negotiable parts. </p><p>The Anatomy Of A Champion The champion can train all day, run faster, lift stronger, leap higher ... the muscles will eventually tire. However, a true champion understands how to take care of the body to get the most out of it. Rest, nutrition, hydration and training. The best do it best. This is a no-brainer. But there is so much more than this. The physical being can only do so much. We work our way down through the inner champion in order of appearance. </p>","imgs":"imgs/softball.jpg"},
{"id":"3","type":"Both","name":"Swiming","benefit":"<p>Swimming is the self-propulsion of a person through water, or other liquid, usually for recreation, sport, exercise, or survival. Locomotion is achieved through coordinated movement of the limbs and the body to achieve hydrodynamic thrust which results in directional motion. Humans can hold their breath underwater and undertake rudimentary locomotive swimming within weeks of birth, as a survival response.</p> <p>Swimming involves repeated motions known as strokes in order to propel the body forward. While the front crawl is widely regarded as the fastest out of four primary strokes, other strokes are practiced for special purposes, such as for training. </p> <p>There are various risks present during swimming, mainly due to it taking place in water. Swimmers are at risk of incapacitation due to panic and exhaustion, which may cause death due to drowning. Other dangers include getting an infection or contact with hostile aquatic fauna. To minimize these risks, most facilities employ a lifeguard to look for signs of distress. </p> ","anatomy":"<p>Swimming Anatomy includes 74 of the most effective swimming exercises, each with step-by-step descriptions and full-color anatomical illustrations highlighting the primary muscles in action </p> <p>Swimming Anatomy goes beyond exercises by placing you on the starting block, in the water, and into the throes of competition. Illustrations of the active muscles for starts, turns, and the four competitive strokes (freestyle, breaststroke, butterfly, and backstroke) show you how each exercise is fundamentally linked to swimming performance. </p> <p>You’ll also learn how exercises can be modified to target specific areas, improve your form in the water, and minimize common swimming injuries. Best of all, you’ll learn how to put it all together to develop a training program based on your individual needs and goals. </p>","imgs":"imgs/swimming.jpg"},
{"id":"4","type":"Both","name":"Circuit Training","benefit":"<p>Circuit training is a type of training that involves rotating between several exercises that target different muscle groups with minimal rest in between. It’s ideal for those looking for a quick, effective, full-body workout. </p><p>With circuit training, you usually perform a high number of reps for each exercise. This involves the recruitment of slow-twitch muscle fibers to help you sustain the exercise longer </p><p>Depending on the exercises you perform during the circuit, you may be able to build stronger and larger muscles. Muscle growth (hypertrophy) requires a person to lift moderate to heavy weights or perform a high number of reps just before failure, a point at which you can’t do another rep, to stimulate muscle growth. </p><p>Circuit training is a favorite for many because it combines strength training and cardiorespiratory training. Since there is little rest between exercises, your heart rate stays elevated throughout the circuit. This helps strengthen and decrease stress on your heart, allowing it to push more blood into the body with less effort. It also helps increase lung capacity, allowing you to breathe more efficiently as you exercise. As you build your lung capacity, you’ll fatigue less easily during each circuit. </p>","anatomy":"<p>Anatomy of Fitness: Total Body Workout shows you how to effectively train your entire body in unison, using movements that we encounter every day to reach optimal fitness.  </p><p>Anatomy of Fitness: Total Body Workout includes a comprehensive introduction to total-body training; step-by-step instructions for over 60 body-weight exercises, added-weight exercises, resistance exercises, and stretching-and-releasing exercises; and a range of total-body workouts, so anyone can tailor a program to suit their fitness requirements. </p>","imgs":"imgs/circuit-training.png"},
{"id":"5","type":"Both","name":"Water Aerobics","benefit":"<p>Water aerobics is a fun, easy way to get your body moving. It consists of being submerged, usually about waist deep, in water and moving your body in various ways to take on the water’s resistance. Water aerobics is a healthy mix of cardiovascular and muscular training, and it puts your whole body to work! What are the benefits, and why should you get started with water aerobics as soon as possible? Well, there are plenty of reasons, but here are just a few of them.</p><p>Water aerobics is an excellent way to get into shape. You’re moving your whole body, and if you’re in deep enough water, you’re never fully at rest! Even treading water keeps your heart rate elevated. Cardiovascular health is absolutely critical to overall health, especially for older populations. Keeping your heart healthy is crucial to living a long, healthy life. 1 out of every 4 deaths in the US are linked to heart disease, so cardio work is important! Luckily, water aerobics is a great way to keep your heart in good health! </p><p>Unfortunately, it’s the sad truth that over 30% of adults aged 45-64 have some joint pain. There are many factors involved in this, but continuous stress on certain joints will usually lead to chronic pain. Water aerobics is a joint-friendly sport with very low impact. Runners can just as easily get the same cardiovascular benefits, and lifters can easily get the same strength benefits. However, this comes at a potentially greater risk to their joint health than with underwater exercise. </p><p>Any activity you do in the water comes with muscular endurance. Your body will adapt to keeping your head above the water for longer periods of time, which can easily lead to a decrease in muscular pain over time! Lower repetitions with higher weight will make you stronger more quickly, but lower-intensity sustained motions will increase your physical endurance dramatically. </p><p>This is an obvious one, but you may not realize to what extent! Water aerobics can burn between 500 and 1000 calories per hour! Compare that to walking, which will only get you between 210 and 360! Water aerobics is ranked as one of the highest calorie-burning exercises out there, right next to lap swimming! But, as anybody who has done them will know, water aerobics are more fun! </p>","anatomy":"<p>The problem with this is that those types of exercises aren't always the best choice for older adults with chronic disorders, injuries, or physical limitations. That's where water-based exercise like water aerobics reigns supreme. Even if water exercise is low impact, it's not necessarily less effective in preventing age-related bone deterioration. Water exercise is good for your bones and it can decrease the rate of bone loss. </p><p>The reason for this is that when you push against water, it pushes back. By using maximum effort in your strength training exercises in water without shortening the range of motion, bone mineral density is typically at least maintained if not improved, according to a study on postmenopausal women. </p>","imgs":"imgs/water-aerobics.jpg"},
{"id":"6","type":"Both","name":"Jogging","benefit":"<p>Jogging is a type of running that takes place at a slow and steady pace, usually less than six miles per hour. As a result, while jogging is less strenuous than running, it is more difficult than walking. The purpose of jogging is to keep a consistent pace throughout the workout without putting too much pressure on the body. Because jogging is less stressful on the body than running, it can be done for longer periods of time. </p><p>The cardiovascular system, which includes the heart, lungs, and blood vessels, is the most visible consequence of jogging on the body. You're probably aware that when you exercise, your body responds by raising your heart rate and breathing rate to meet the demands of the activity. The goal is to keep providing oxygen-rich blood to the working muscles so that they can use it for energy. This increase will also allow waste products such as carbon dioxide to be removed from the body. The strength and function of the cardiovascular system, notably your resting heart rate, improves when you jog regularly. </p><p>To perform the movements required for running, several muscles must be regularly contracted. The glutes, quadriceps, hamstrings, and calves are the muscles of the lower extremities that are principally responsible for mobility. While the legs push back and forth, the core and upper body muscles must activate to rotate and stabilise the trunk. Regular jogging will put stress on these muscles, forcing them to adapt and grow stronger. Muscle strength will have a favourable impact on how you move and reduce your chance of injury.  </p>","anatomy":"<p>Muscular endurance refers to the muscles' ability to perform repetitive contractions for an extended amount of time without rest. To maintain a jogging pace, the muscles must be capable of continuously contracting. The muscles will begin to adapt and their endurance capacity will improve with regular jogging. Because jogging workouts are often long in duration but low in intensity, it is particularly useful for building muscle endurance.</p><p>Jogging affects bone density in addition to muscle strength and endurance. The amount of bone mineral contained within the bone is referred to as bone density, and having a high bone density boosts the bone's strength. The impacts involved with the foot strike in running have regularly been proven to help develop bone density in studies. As a result, it can be inferred that jogging improves bone health and reduces the risk of developing bone-wasting illnesses like osteoporosis. </p>","imgs":"imgs/jogging.jpg"}
]
}
